function [ym,Pc,Cost_total,Price_Charge]=innersolve(x,z,pc,num_LA,P0)
yalmip('clear');
global N1
global N2
global N3
global Zc
global t
i=t;%%%%%%4月9日变动
n1=N1(num_LA);
n2=N2(num_LA);
n3=N3(num_LA);
% k1=0.0001;
price_day_ahead=[0.35;0.33;0.3;0.33;0.36;0.4;0.44;0.46;0.52;0.58;0.66;0.75;0.81;0.76;0.8;0.83;0.81;0.75;0.64;0.55;0.53;0.47;0.40;0.37];
pp0=z;
Pc10=pc(:,1);
Pc20=pc(:,2);
Pc30=pc(:,3);
Ps_day0=[1819.76524892076;1664.97358224576;1355.39024903326;1350.00300857143;891.015249033259;581.431915458260;426.640249033259;450.000000000000;379.793646787497;0;0;0;0;0;0;0;0;449.996040000002;450.000000000002;70.2103132124991;0;0;1200.59858224576;1510.18191545826];
% pt=0.6*sdpvar(24,1);
PL=[1733.66666666000;1857.50000000000;2105.16666657000;2352.83333343000;2476.66666657000;2724.33333343000;2848.16666657000;2972;3219.66666657000;3467.33333343000;3591.16666657000;3715.00000000000;3467.33333343000;3219.66666657000;2972;2600.50000000000;2476.66666657000;2724.33333343000;2972;3467.33333343000;3219.66666657000;2724.33333343000;2229;1981.33333343000]*3;
% Qideal=PL+(N1+N2+N3)*X/24;
a=x*PL/mean(PL);%mean求均值
b=0.003/mean(PL)*ones(24,1);
% price_s=1.2*price_day_ahead;
lb=0.8*price_day_ahead;
ub=1.2*price_day_ahead;
T_1=[1;1;1;1;1;1;1;0;0;0;0;0;0;0;0;0;0;0;0;0;1;1;1;1];
T_2=[1;1;1;1;1;1;1;1;0;0;0;0;1;1;1;0;0;0;0;1;1;1;1;1];
T_3=[0;0;0;0;0;0;0;1;1;1;1;1;1;1;1;1;1;1;1;1;0;0;0;0];
Ce=sdpvar(24-i+1,1);%聚合商电价
M=10000;
Pdis=ones(24-i+1,1);
% z=binvar(24,1);%购售电状态
Ps_day=sdpvar(24-i+1,1);%实时售电
PL1=PL(i:24,1)+Ps_day;
% Pb=sdpvar(24-i+1,1);%日前购电
Pc1=sdpvar(24-i+1,1);%一类用电功率早出晚归
Pc2=sdpvar(24-i+1,1);%二类用电功率正常
Pc3=sdpvar(24-i+1,1);%三类用电功率
% C=[lb<=Ce<=ub,mean(Ce)==0.5,Ps_day<=M*Pdis,Ps_day>=0];%边界约束
% if t<13
    C=[lb(i:24,1)<=Ce<=ub(i:24,1),mean(Ce)==0.5,Ps_day>=0];%边界约束
% else 
%     C=[lb(i:24,1)<=Ce<=ub(i:24,1),mean(Ce)==0.5,Ps_day>=0];%边界约束
% end
%,pt==0.6*price_day_ahead-k1*abs(PL+(n1+n2+n3)*X/24-Ps_day)
C=[C,Pc1+Pc2+Pc3==Ps_day];%能量平衡
L_u=sdpvar(1,3);%电量需求等式约束的拉格朗日函数（η）
L_lb=sdpvar(24-i+1,3);%充电功率下限约束的拉格朗日函数（μ）
L_ub=sdpvar(24-i+1,3);%充电功率上限约束的拉格朗日函数
L_T=sdpvar(24-i+1,3);%充电可用时间约束的拉格朗日函数
f=n1*L_u(1)*(Zc)+n2*L_u(2)*(Zc)+n3*L_u(3)*(Zc)+sum(sum(L_ub).*[n1*3,n2*3,n3*3])-sum(a(i:24,1).*Ps_day+b(i:24,1).*Ps_day.^2);%目标函数
C=[C,Ce-L_u(1)*ones(24-i+1,1)-L_lb(:,1)-L_ub(:,1)-L_T(:,1)==0,Ce-L_u(2)*ones(24-i+1,1)-L_lb(:,2)-L_ub(:,2)-L_T(:,2)==0,Ce-L_u(3)*ones(24-i+1,1)-L_lb(:,3)-L_ub(:,3)-L_T(:,3)==0];%KKT条件
C=[C,sum(Pc1)==n1*(Zc)-sum(Pc10(1:i-1)),sum(Pc2)==n2*(Zc)-sum(Pc20(1:i-1)),sum(Pc3)==n3*(Zc)-sum(Pc30(1:i-1))];%电量需求约束%%%%%%4月9日变动
for t1=i:24
    if T_1(t1)==0
        C=[C,Pc1(t1-i+1)==0];
    else
        C=[C,L_T(t1-i+1,1)==0];
    end
    if T_2(t1)==0
        C=[C,Pc2(t1-i+1)==0];
    else
        C=[C,L_T(t1-i+1,2)==0];
    end
    if T_3(t1)==0
        C=[C,Pc3(t1-i+1)==0];
    else
        C=[C,L_T(t1-i+1,3)==0];
    end
end
b_lb=binvar(24-i+1,3);%用电功率下限约束的松弛变量
b_ub=binvar(24-i+1,3);%用电功率上限约束的松弛变量

for t1=i:24
    if T_1(t1)==0
        C=[C,L_ub(t1-i+1,1)==0,b_ub(t1-i+1,1)==1,b_lb(t1-i+1,1)==1];
    else
        C=[C,L_lb(t1-i+1,1)>=0,L_lb(t1-i+1,1)<=M*b_lb(t1-i+1,1),Pc1(t1-i+1)>=0,Pc1(t1-i+1)<=M*(1-b_lb(t1-i+1,1)),Pc1(t1-i+1)<=n1*3,n1*3-Pc1(t1-i+1)<=M*b_ub(t1-i+1,1),L_ub(t1-i+1,1)<=0,L_ub(t1-i+1,1)>=M*(b_ub(t1-i+1,1)-1)];
    end
    if T_2(t1)==0
        C=[C,L_ub(t1-i+1,2)==0,b_ub(t1-i+1,2)==1,b_lb(t1-i+1,2)==1];
    else
        C=[C,L_lb(t1-i+1,2)>=0,L_lb(t1-i+1,2)<=M*b_lb(t1-i+1,2),Pc2(t1-i+1)>=0,Pc2(t1-i+1)<=M*(1-b_lb(t1-i+1,2)),Pc2(t1-i+1)<=n2*3,n2*3-Pc2(t1-i+1)<=M*b_ub(t1-i+1,2),L_ub(t1-i+1,2)<=0,L_ub(t1-i+1,2)>=M*(b_ub(t1-i+1,2)-1)];
    end
    if T_3(t1-i+1)==0
        C=[C,L_ub(t1-i+1,3)==0,b_ub(t1-i+1,3)==1,b_lb(t1-i+1,3)==1];
    else
        C=[C,L_lb(t1-i+1,3)>=0,L_lb(t1-i+1,3)<=M*b_lb(t1-i+1,3),Pc3(t1-i+1)>=0,Pc3(t1-i+1)<=M*(1-b_lb(t1-i+1,3)),Pc3(t1-i+1)<=n3*3,n3*3-Pc3(t1-i+1)<=M*b_ub(t1-i+1,3),L_ub(t1-i+1,3)<=0,L_ub(t1-i+1,3)>=M*(b_ub(t1-i+1,3)-1)];
    end
end
ops=sdpsettings('solver','cplex');
solvesdp(C,-f,ops);
Pc=[double(Pc1),double(Pc2),double(Pc3)];
Ps_day=double(Ps_day);
% S=double(S);
Cost_total=double(f);
%Price_Charge0=[0.418285714285714;0.396000000000000;0.360000000000000;0.396000000000000;0.418285714285714;0.418285714285714;0.418285714285714;0.512000000000000;0.512000000000000;0.512000000000000;0.528000000000000;0.600000000000000;0.648000000000000;0.608000000000000;0.640000000000000;0.664000000000000;0.648000000000000;0.600000000000000;0.512000000000000;0.512000000000000;0.424000000000000;0.418285714285714;0.418285714285714;0.418285714285714];%%%%%%4月9日变动
Price_Charge1=double(Ce);%%%%%%4月9日变动
Price_Charge=[P0(1:i-1,1);Price_Charge1];%%%%%%4月9日变动
clear ans b_lb b_ub C Ce f L_lb L_ub L_T L_u lb M ops Pc1 Pc2 Pc3 price_b price_day_ahead price_s t T_1 T_2 T_3 u ub z
% plot(PL);
% plot(PL+(N1+N2+N3)*X/24)
% hold on
% plot(PL+Ps_day,'r');
PP=[pp0(1:i-1);PL(i:24)+Ps_day];%%%%%%4月9日变动
ym=PP;%%%%%%4月9日变动
