function [a,a1,a2,a3,a4,a5,a6,a7,a8,b7,b8]=h9(Eload,Hload,t9)


%% 初始化状态变量

% x1(1)=2*pv1*0.0533+23.45;x2(1)=2*t1*0.06+12.3;x3(1)=34.095;x4(1)=LA(1,1)*2*0.0675+21.1;x5(1)=33.9;x6(1)=27.8;x7(1)=39.3;x8(1)=LA(1,2)*2*0.03+12;x9(1)=18.04;x10(1)=23.68;x11(1)=36.372;x12(1)=LA(1,3)*2*0.0322+20;%需求量D1*2*0.0533+23.45,需求量D1=y1+p1
% p1(1)=pv1;p2(1)=t1;p3(1)=105;p4(1)=LA(1,1);p5(1)=100;p6(1)=110;p7(1)=150;p8(1)=LA(1,2);p9(1)=90;p10(1)=80;p11(1)=90;p12(1)=LA(1,3);%p2=95
% % y1(1)=100;y2(1)=10;y3(1)=50;y4(1)=-100;y5(1)=50;y6(1)=-10;y7(1)=-37;y8(1)=100;y9(1)=100;%变量初始化
% y1(1)=0;y2(1)=0;y3(1)=0;y4(1)=0;y5(1)=0;y6(1)=0;y7(1)=0;y8(1)=0;y9(1)=0;y10(1)=0;y11(1)=0;y12(1)=0;%变量初始
x1(1)=2*89.07*0.0833+13.45;x2(1)=2*t9*0.0825+15;x3(1)=31.535;x4(1)=Eload(1)*2*0.0875+19.1;x5(1)=34.7;x6(1)=21.6;x7(1)=26.2;x8(1)=Hload(1)*2*0.07+12;x9(1)=10.56;x10(1)=16.32;x11(1)=15.124;x12(1)=35*2*0.0822+10;%需求量D1*2*0.0533+23.45,需求量D1=y1+p1
p1(1)=89.07;p2(1)=t9;p3(1)=125;p4(1)=Eload(1);p5(1)=150;p6(1)=90;p7(1)=80;p8(1)=Hload(1);p9(1)=60;p10(1)=60;p11(1)=30;p12(1)=35;%p2=95
% y1(1)=100;y2(1)=10;y3(1)=50;y4(1)=-100;y5(1)=50;y6(1)=-10;y7(1)=-37;y8(1)=100;y9(1)=100;%变量初始化
%y1(1)=0;y2(1)=0;y3(1)=0;y4(1)=0;y5(1)=0;y6(1)=0;y7(1)=0;y8(1)=0;y9(1)=0;y10(1)=0;y11(1)=0;y12(1)=0;%变量初始
y1(1)=100;y2(1)=10;y3(1)=50;y4(1)=-100;y5(1)=50;y6(1)=-10;y7(1)=-40;y8(1)=100;y9(1)=100;y10(1)=-10;y11(1)=10;y12(1)=-10;%变量初始
%% 状态分解经济增量

x1_2(1)=x1(1)/4 ;x1_3(1)=x1(1)/4;x1_4(1)=x1(1)/4;x1_5(1)=x1(1)/4;
x2_1(1)=x2(1)/4 ;x2_3(1)=x2(1)/4 ;x2_4(1)=x2(1)/4;x2_5(1)=x2(1)/4 ;
x3_1(1)=x3(1)/4 ;x3_2(1)=x3(1)/4;x3_4(1)=x3(1)/4;x3_5(1)=x3(1)/4 ;
x4_1(1)=x4(1)/4 ;x4_2(1)=x4(1)/4 ;x4_3(1)=x4(1)/4 ;x4_5(1)=x4(1)/4;
x5_1(1)=x5(1)/4;x5_2(1)=x5(1)/4 ;x5_3(1)=x5(1)/4 ;x5_4(1)=x5(1)/4;
x6_7(1)=x6(1)/3 ;x6_8(1)=x6(1)/3 ;x6_9(1)=x6(1)/3 ;
x7_6(1)=x7(1)/3  ;x7_8(1)=x7(1)/3 ;x7_9(1)=x7(1)/3  ;
x8_6(1)=x8(1)/3 ;x8_7(1)=x8(1)/3 ;x8_9(1)=x8(1)/3 ;
x9_6(1)=x9(1)/3 ;x9_7(1)=x9(1)/3 ;x9_8(1)=x9(1)/3;


%% 状态分解局部功率失配

y1_2(1)=y1(1)/4 ;y1_3(1)=y1(1)/4 ;y1_4(1)=y1(1)/4 ;y1_5(1)=y1(1)/4 ;
y2_1(1)=y2(1)/4 ;y2_3(1)=y2(1)/4 ;y2_4(1)=y2(1)/4 ;y2_5(1)=y2(1)/4 ;
y3_1(1)=y3(1)/4;y3_2(1)=y3(1)/4 ;y3_4(1)=y3(1)/4;y3_5(1)=y3(1)/4 ;
y4_1(1)=y4(1)/4 ;y4_2(1)=y4(1)/4 ;y4_3(1)=y4(1)/4 ;y4_5(1)=y4(1)/4 ;
y5_1(1)=y5(1)/4 ;y5_2(1)=y5(1)/4 ;y5_3(1)=y5(1)/4 ;y5_4(1)=y5(1)/4 ;
y6_7(1)=y6(1)/3 ;y6_8(1)=y6(1)/3 ;y6_9(1)=y6(1)/3 ;
y7_6(1)=y7(1)/3 ;y7_8(1)=y7(1)/3 ;y7_9(1)=y7(1)/3 ;
y8_6(1)=y8(1)/3 ;y8_7(1)=y8(1)/3 ;y8_9(1)=y8(1)/3 ;
y9_6(1)=y9(1)/3;y9_7(1)=y9(1)/3 ;y9_8(1)=y9(1)/3 ;




X=zeros(9,500);%增量成本
X_1=zeros(4,500);%增量成本分解的子成本
X_2=zeros(4,500);
X_3=zeros(4,500);
X_4=zeros(4,500);
X_5=zeros(4,500);
X_6=zeros(3,500);
X_7=zeros(3,500);
X_8=zeros(3,500);
X_9=zeros(3,500);



P=zeros(9,500);%机组的出力



Y=zeros(9,500);%局部功率偏差
Y_1=zeros(4,500);%局部功率偏差的子偏差
Y_2=zeros(4,500);
Y_3=zeros(4,500);
Y_4=zeros(4,500);
Y_5=zeros(4,500);
Y_6=zeros(3,500);
Y_7=zeros(3,500);
Y_8=zeros(3,500);
Y_9=zeros(3,500);



L=zeros(9,500);%负荷
sump=zeros(1,500);%系统的总电功率
sumh=zeros(1,500);%系统的总热功率  %设置数据存储矩阵
sumg=zeros(1,500);%系统的总气功率
h=0.04;%学习增益0.005

a=0;
a1=0;
a2=0;
a3=0;
a4=0;
a5=0;
a6=0;
a7=0;
a8=0;
b=0;
b1=0;
b2=0;
b3=0;
b4=0;
b5=0;
b6=0;
b7=0;
b8=0;
a13=0;
a14=0;

%% 设置数据存储矩阵

%% 设置数据存储矩阵

for k=1:20  %正常运行
    X(1,k)=x1(k);P(1,k)=p1(k);Y(1,k)=y1(k);
    X(2,k)=x2(k); P(2,k)=p2(k);Y(2,k)=y2(k);
    X(3,k)=x3(k);P(3,k)=p3(k);Y(3,k)=y3(k);
    X(4,k)=x4(k);P(4,k)=p4(k);Y(4,k)=y4(k);
    X(5,k)=x5(k);P(5,k)=p5(k);Y(5,k)=y5(k);
    X(6,k)=x6(k);P(6,k)=p6(k);Y(6,k)=y6(k);
    X(7,k)=x7(k);P(7,k)=p7(k);Y(7,k)=y7(k);  
    X(8,k)=x8(k);P(8,k)=p8(k);Y(8,k)=y8(k);
    X(9,k)=x9(k);P(9,k)=p9(k);Y(9,k)=y9(k);
  


    X_1(1,k)=x1_2(k);Y_1(1,k)=y1_2(k);
    X_1(2,k)=x1_3(k);Y_1(2,k)=y1_3(k);
    X_1(3,k)=x1_4(k);Y_1(3,k)=y1_4(k);
    X_1(4,k)=x1_5(k);Y_1(4,k)=y1_5(k); %子状态数据存储状态
   

    X_2(1,k)=x2_1(k);Y_2(1,k)=y2_1(k);
    X_2(2,k)=x2_3(k);Y_2(2,k)=y2_3(k);
    X_2(3,k)=x2_4(k);Y_2(3,k)=y2_4(k);
    X_2(4,k)=x2_5(k);Y_2(4,k)=y2_5(k);
 
   
    


    X_3(1,k)=x3_1(k);Y_3(1,k)=y3_1(k);
    X_3(2,k)=x3_2(k);Y_3(2,k)=y3_2(k);
    X_3(3,k)=x3_4(k);Y_3(3,k)=y3_4(k);
    X_3(4,k)=x3_5(k);Y_3(4,k)=y3_5(k);
  
    


    X_4(1,k)=x4_1(k);Y_4(1,k)=y4_1(k);
    X_4(2,k)=x4_2(k);Y_4(2,k)=y4_2(k);
    X_4(3,k)=x4_3(k);Y_4(3,k)=y4_3(k);
    X_4(4,k)=x4_5(k);Y_4(4,k)=y4_5(k);
   
 
    

    X_5(1,k)=x5_1(k);Y_5(1,k)=y5_1(k);
    X_5(2,k)=x5_2(k);Y_5(2,k)=y5_2(k);
    X_5(3,k)=x5_3(k);Y_5(3,k)=y5_3(k);
    X_5(4,k)=x5_4(k);Y_5(4,k)=y5_4(k);
  
    
    
    X_6(1,k)=x6_7(k);Y_6(1,k)=y6_7(k);
    X_6(2,k)=x6_8(k);Y_6(2,k)=y6_8(k);  
    X_6(3,k)=x6_9(k);Y_6(3,k)=y6_9(k);


   
    X_7(1,k)=x7_6(k);Y_7(1,k)=y7_6(k);
    X_7(2,k)=x7_8(k);Y_7(2,k)=y7_8(k);  
    X_7(3,k)=x7_9(k);Y_7(3,k)=y7_9(k);


    
    X_8(1,k)=x8_6(k);Y_8(1,k)=y8_6(k);
    X_8(2,k)=x8_7(k);Y_8(2,k)=y8_7(k);  
    X_8(3,k)=x8_9(k);Y_8(3,k)=y8_9(k);


   
    X_9(1,k)=x9_6(k);Y_9(1,k)=y9_6(k);
    X_9(2,k)=x9_7(k);Y_9(2,k)=y9_7(k);  
    X_9(3,k)=x9_8(k);Y_9(3,k)=y9_8(k);

  
%% 状态关系1
% x
x1(k)= x2_1(k)+x3_1(k)+x4_1(k)+x5_1(k);
x2(k)= x1_2(k)+x3_2(k)+x4_2(k)+x5_2(k);
x3(k)= x1_3(k)+x2_3(k)+x4_3(k)+x5_3(k);
x4(k)= x1_4(k)+x2_4(k)+x3_4(k)+x5_4(k);
x5(k)= x1_5(k)+x2_5(k)+x3_5(k)+x4_5(k);
x6(k)= x7_6(k)+x8_6(k)+x9_6(k);
x7(k)= x6_7(k)+x8_7(k)+x9_7(k);
x8(k)= x6_8(k)+x7_8(k)+x9_8(k);
x9(k)= x6_9(k)+x7_9(k)+x8_9(k);


% y
y1(k)= y2_1(k)+y3_1(k)+y4_1(k)+y5_1(k);
y2(k)= y1_2(k)+y3_2(k)+y4_2(k)+y5_2(k);
y3(k)= y1_3(k)+y2_3(k)+y4_3(k)+y5_3(k);
y4(k)= y1_4(k)+y2_4(k)+y3_4(k)+y5_4(k);
y5(k)= y1_5(k)+y2_5(k)+y3_5(k)+y4_5(k);
y6(k)= y7_6(k)+y8_6(k)+y9_6(k);
y7(k)= y6_7(k)+y8_7(k)+y9_7(k);
y8(k)= y6_8(k)+y7_8(k)+y9_8(k);
y9(k)= y6_9(k)+y7_9(k)+y8_9(k);




x1(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y1(k);
    p1(k+1)=(x1(k+1)-13.45)/(2*0.0833);
    y1(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p1(k)-p1(k+1);%运用完全分布式经济调度算法进行迭代
   
    x2(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y2(k);
    p2(k+1)=(x2(k+1)-15)/(2*0.0825);
    y2(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p2(k)-p2(k+1);
    
    x3(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y3(k);
    p3(k+1)=(x3(k+1)-20.66)/(2*0.0935);
    y3(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p3(k)-p3(k+1);
    
    x4(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y4(k);
    p4(k+1)=(x4(k+1)-19.1)/(2*0.0875);
    y4(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p4(k)-p4(k+1);
   
    x5(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y5(k);
    p5(k+1)=(x5(k+1)-12.5-0.04*p6(k))/(2*0.06);%增大电、热、气间的耦合系数可以
    y5(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p5(k)-p5(k+1);
    
    x6(k+1)=1/4*(x6(k)+x7(k)+x8(k)+x9(k))+h*y6(k);
    p6(k+1)=(x6(k+1)-4.2-0.04*p5(k+1))/(2*0.06);
    y6(k+1)=1/4*(y6(k)+y7(k)+y8(k)+y9(k))+p6(k)-p6(k+1);
    
    x7(k+1)=1/4*(x6(k)+x7(k)+x8(k)+x9(k))+h*y7(k);
    p7(k+1)=(x7(k+1)-15)/(2*0.07);
    y7(k+1)=1/4*(y6(k)+y7(k)+y8(k)+y9(k))+p7(k)-p7(k+1);
    
   
    x8(k+1)=1/4*(x6(k)+x7(k)+x8(k)+x9(k))+h*y8(k);
    p8(k+1)=(x8(k+1)-12)/(2*0.07);
    y8(k+1)=1/4*(y6(k)+y7(k)+y8(k)+y9(k))+p8(k)-p8(k+1);
    
    
    x9(k+1)=1/4*(x6(k)+x7(k)+x8(k)+x9(k))+h*y9(k);
    p9(k+1)=(x9(k+1)-11.2)/(2*0.078);                           
    y9(k+1)=1/4*(y6(k)+y7(k)+y8(k)+y9(k))+p9(k)-p9(k+1);



    %% 状态关系2
 
 
% lamda
x1_2(k+1)=x1(k+1)/4 ;x1_3(k+1)=x1(k+1)/4;x1_4(k+1)=x1(k+1)/4;x1_5(k+1)=x1(k+1)/4;
x2_1(k+1)=x2(k+1)/4 ;x2_3(k+1)=x2(k+1)/4 ;x2_4(k+1)=x2(k+1)/4 ;x2_5(k+1)=x2(k+1)/4 ;
x3_1(k+1)=x3(k+1)/4 ;x3_2(k+1)=x3(k+1)/4 ;x3_4(k+1)=x3(k+1)/4 ;x3_5(k+1)=x3(k+1)/4 ;
x4_1(k+1)=x4(k+1)/4;x4_2(k+1)=x4(k+1)/4 ;x4_3(k+1)=x4(k+1)/4;x4_5(k+1)=x4(k+1)/4;
x5_1(k+1)=x5(k+1)/4;x5_2(k+1)=x5(k+1)/4 ;x5_3(k+1)=x5(k+1)/4 ;x5_4(k+1)=x5(k+1)/4;
x6_7(k+1)=x6(k+1)/3 ;x6_8(k+1)=x6(k+1)/3 ;x6_9(k+1)=x6(k+1)/3 ;
x7_6(k+1)=x7(k+1)/3  ;x7_8(k+1)=x7(k+1)/3 ;x7_9(k+1)=x7(k+1)/3 ;
x8_6(k+1)=x8(k+1)/3 ;x8_7(k+1)=x8(k+1)/3 ;x8_9(k+1)=x8(k+1)/3 ;
x9_6(k+1)=x9(k+1)/3 ;x9_7(k+1)=x9(k+1)/3 ;x9_8(k+1)=x9(k+1)/3;




% y
y1_2(k+1)=y1(k+1)/4 ;y1_3(k+1)=y1(k+1)/4;y1_4(k+1)=y1(k+1)/4;y1_5(k+1)=y1(k+1)/4;
y2_1(k+1)=y2(k+1)/4 ;y2_3(k+1)=y2(k+1)/4 ;y2_4(k+1)=y2(k+1)/4 ;y2_5(k+1)=y2(k+1)/4 ;
y3_1(k+1)=y3(k+1)/4 ;y3_2(k+1)=y3(k+1)/4 ;y3_4(k+1)=y3(k+1)/4 ;y3_5(k+1)=y3(k+1)/4 ;
y4_1(k+1)=y4(k+1)/4 ;y4_2(k+1)=y4(k+1)/4 ;y4_3(k+1)=y4(k+1)/4;y4_5(k+1)=y4(k+1)/4;
y5_1(k+1)=y5(k+1)/4;y5_2(k+1)=y5(k+1)/4 ;y5_3(k+1)=y5(k+1)/4 ;y5_4(k+1)=y5(k+1)/4;
y6_7(k+1)=y6(k+1)/3 ;y6_8(k+1)=y6(k+1)/3 ;y6_9(k+1)=y6(k+1)/3 ;
y7_6(k+1)=y7(k+1)/3  ;y7_8(k+1)=y7(k+1)/3;y7_9(k+1)=y7(k+1)/3 ;
y8_6(k+1)=y8(k+1)/3 ;y8_7(k+1)=y8(k+1)/3 ;y8_9(k+1)=y8(k+1)/3 ;
y9_6(k+1)=y9(k+1)/3 ;y9_7(k+1)=y9(k+1)/3 ;y9_8(k+1)=y9(k+1)/3;


    
    sump(1,k)=sum(P(1:5,k));%电出力求和
    sumh(1,k)=sum(P(6:9,k));%热出力求和


    for i=1:9
       L(i,k)=P(i,k)-Y(i,k);
    end
end 





%% 设置数据存储矩阵
for k=20:50  %受到攻击%20-40
   
    X(1,k)=x1(k);P(1,k)=p1(k);Y(1,k)=y1(k);
    X(2,k)=x2(k); P(2,k)=p2(k);Y(2,k)=y2(k);
    X(3,k)=x3(k);P(3,k)=p3(k);Y(3,k)=y3(k);
    X(4,k)=x4(k);P(4,k)=p4(k);Y(4,k)=y4(k);
    X(5,k)=x5(k);P(5,k)=p5(k);Y(5,k)=y5(k);
    X(6,k)=x6(k);P(6,k)=p6(k);Y(6,k)=y6(k);
    X(7,k)=x7(k);P(7,k)=p7(k);Y(7,k)=y7(k);  
    X(8,k)=x8(k);P(8,k)=p8(k);Y(8,k)=y8(k);
    X(9,k)=x9(k);P(9,k)=p9(k);Y(9,k)=y9(k);
  

%     X_1(1,k)=x1_2(k);Y_1(1,k)=y1_2(k);
%     X_1(2,k)=x1_3(k);Y_1(2,k)=y1_3(k);
%     X_1(3,k)=x1_4(k);Y_1(3,k)=y1_4(k);
%     X_1(4,k)=x1_5(k);Y_1(4,k)=y1_5(k); %子状态数据存储状态
%    
% 
%     X_2(1,k)=x2_1(k);Y_2(1,k)=y2_1(k);
%     X_2(2,k)=x2_3(k);Y_2(2,k)=y2_3(k);
%     X_2(3,k)=x2_4(k);Y_2(3,k)=y2_4(k);
%     X_2(4,k)=x2_5(k);Y_2(4,k)=y2_5(k);
%  
%    
%     
% 
% 
%     X_3(1,k)=x3_1(k);Y_3(1,k)=y3_1(k);
%     X_3(2,k)=x3_2(k);Y_3(2,k)=y3_2(k);
%     X_3(3,k)=x3_4(k);Y_3(3,k)=y3_4(k);
%     X_3(4,k)=x3_5(k);Y_3(4,k)=y3_5(k);
%   
%     
% 
% 
%     X_4(1,k)=x4_1(k);Y_4(1,k)=y4_1(k);
%     X_4(2,k)=x4_2(k);Y_4(2,k)=y4_2(k);
%     X_4(3,k)=x4_3(k);Y_4(3,k)=y4_3(k);
%     X_4(4,k)=x4_5(k);Y_4(4,k)=y4_5(k);
%    
%  
%     
% 
%     X_5(1,k)=x5_1(k);Y_5(1,k)=y5_1(k);
%     X_5(2,k)=x5_2(k);Y_5(2,k)=y5_2(k);
%     X_5(3,k)=x5_3(k);Y_5(3,k)=y5_3(k);
%     X_5(4,k)=x5_4(k);Y_5(4,k)=y5_4(k);
%   
%     
%     
%     X_6(1,k)=x6_7(k);Y_6(1,k)=y6_7(k);
%     X_6(2,k)=x6_8(k);Y_6(2,k)=y6_8(k);  
%     X_6(3,k)=x6_9(k);Y_6(3,k)=y6_9(k);
% 
% 
%    
%     X_7(1,k)=x7_6(k);Y_7(1,k)=y7_6(k);
%     X_7(2,k)=x7_8(k);Y_7(2,k)=y7_8(k);  
%     X_7(3,k)=x7_9(k);Y_7(3,k)=y7_9(k);
% 
% 
%     
%     X_8(1,k)=x8_6(k);Y_8(1,k)=y8_6(k);
%     X_8(2,k)=x8_7(k);Y_8(2,k)=y8_7(k);  
%     X_8(3,k)=x8_9(k);Y_8(3,k)=y8_9(k);
% 
% 
%    
%     X_9(1,k)=x9_6(k);Y_9(1,k)=y9_6(k);
%     X_9(2,k)=x9_7(k);Y_9(2,k)=y9_7(k);  
%     X_9(3,k)=x9_8(k);Y_9(3,k)=y9_8(k);
% 
% 
% %% 状态关系1
% % x
% x1(k)= x2_1(k)+x3_1(k)+x4_1(k)+x5_1(k);
% x2(k)= x1_2(k)+x3_2(k)+x4_2(k)+x5_2(k);
% x3(k)= x1_3(k)+x2_3(k)+x4_3(k)+x5_3(k);
% x4(k)= x1_4(k)+x2_4(k)+x3_4(k)+x5_4(k);
% x5(k)= x1_5(k)+x2_5(k)+x3_5(k)+x4_5(k);
% x6(k)= x7_6(k)+x8_6(k)+x9_6(k);
% x7(k)= x6_7(k)+x8_7(k)+x9_7(k);
% x8(k)= x6_8(k)+x7_8(k)+x9_8(k);
% x9(k)= x6_9(k)+x7_9(k)+x8_9(k);
% 
% 
% % y
% y1(k)= y2_1(k)+y3_1(k)+y4_1(k)+y5_1(k);
% y2(k)= y1_2(k)+y3_2(k)+y4_2(k)+y5_2(k);
% y3(k)= y1_3(k)+y2_3(k)+y4_3(k)+y5_3(k);
% y4(k)= y1_4(k)+y2_4(k)+y3_4(k)+y5_4(k);
% y5(k)= y1_5(k)+y2_5(k)+y3_5(k)+y4_5(k);
% y6(k)= y7_6(k)+y8_6(k)+y9_6(k);
% y7(k)= y6_7(k)+y8_7(k)+y9_7(k);
% y8(k)= y6_8(k)+y7_8(k)+y9_8(k);
% y9(k)= y6_9(k)+y7_9(k)+y8_9(k);



   [m3]=max([X(6,k),X(7,k),X(8,k),X(9,k)]);
   [m4]=min([X(6,k),X(7,k),X(8,k),X(9,k)]);
   xmax9=0.2*(X(6,k)+X(7,k)+X(8,k)+X(9,k))-0.2*m3+(1-0.4)*m3+0.005*Y(9,k);
   xmin9=0.2*(X(6,k)+X(7,k)+X(8,k)+X(9,k))-0.2*m4+(1-0.4)*m4+0.005*Y(9,k);%求解智能体9的变量的正常范围
   if y9(k)<=(X(6,k)+X(7,k)+X(8,k)+X(9,k)+120) && y9(k)>=0.02*(X(6,k)+X(7,k)+X(8,k)+X(9,k)-120)
       if x9(k)<=xmax9 && x3(k)>=xmin9
          c=1;
       end
     c=(20*0.085+1)/(k*0.085+1);  
   end


   
  %%  分布式算法  
    x1(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y1(k);
    p1(k+1)=(x1(k+1)-13.45)/(2*0.0833);
    y1(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p1(k)-p1(k+1);%运用完全分布式经济调度算法进行迭代
   
    x2(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y2(k);
    p2(k+1)=(x2(k+1)-15)/(2*0.0825);
    y2(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p2(k)-p2(k+1);
    
    x3(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y3(k);
    p3(k+1)=(x3(k+1)-20.66)/(2*0.0935);
    y3(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p3(k)-p3(k+1);
    
    x4(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y4(k);
    p4(k+1)=(x4(k+1)-19.1)/(2*0.0875);
    y4(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p4(k)-p4(k+1);
   
    x5(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y5(k);
    p5(k+1)=(x5(k+1)-12.5-0.04*p6(k))/(2*0.06);%增大电、热、气间的耦合系数可以
    y5(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p5(k)-p5(k+1);
    
    x6(k+1)=1/4*(x6(k)+x7(k)+x8(k)+x9(k))+h*y6(k);
    p6(k+1)=(x6(k+1)-4.2-0.04*p5(k+1))/(2*0.06);
    y6(k+1)=1/(c+3)*y6(k)+1/(c+2)*y7(k)+1/(c+2)*y8(k)+1/(c+3)*y9(k)+p6(k)-p6(k+1);
    
    x7(k+1)=1/4*(x6(k)+x7(k)+x8(k)+x9(k))+h*y7(k);
    p7(k+1)=(x7(k+1)-15)/(2*0.07);
    y7(k+1)=1/(c+3)*y6(k)+1/(c+2)*y7(k)+1/(c+3)*y9(k)+p7(k)-p7(k+1);
    
   
    x8(k+1)=1/4*(x6(k)+x7(k)+x8(k)+x9(k))+h*y8(k);
    p8(k+1)=(x8(k+1)-12)/(2*0.07);
    y8(k+1)=1/(c+3)*y6(k)+1/(c+2)*y8(k)+1/(c+3)*y9(k)+p8(k)-p8(k+1);
    
    
    x9(k+1)=1/4*(x6(k)+x7(k)+x8(k)+x9(k))+h*y9(k);
    p9(k+1)=(x9(k+1)-11.2)/(2*0.078);                           
    y9(k+1)= 130-p9(k+1);


     
     %% 状态关系2
 
% % lamda
% x1_2(k+1)=x1(k+1)/4 ;x1_3(k+1)=x1(k+1)/4;x1_4(k+1)=x1(k+1)/4;x1_5(k+1)=x1(k+1)/4;
% x2_1(k+1)=x2(k+1)/4 ;x2_3(k+1)=x2(k+1)/4 ;x2_4(k+1)=x2(k+1)/4 ;x2_5(k+1)=x2(k+1)/4 ;
% x3_1(k+1)=x3(k+1)/4 ;x3_2(k+1)=x3(k+1)/4 ;x3_4(k+1)=x3(k+1)/4 ;x3_5(k+1)=x3(k+1)/4 ;
% x4_1(k+1)=x4(k+1)/4;x4_2(k+1)=x4(k+1)/4 ;x4_3(k+1)=x4(k+1)/4;x4_5(k+1)=x4(k+1)/4;
% x5_1(k+1)=x5(k+1)/4;x5_2(k+1)=x5(k+1)/4 ;x5_3(k+1)=x5(k+1)/4 ;x5_4(k+1)=x5(k+1)/4;
% x6_7(k+1)=x6(k+1)/3 ;x6_8(k+1)=x6(k+1)/3 ;x6_9(k+1)=x6(k+1)/3 ;
% x7_6(k+1)=x7(k+1)/3  ;x7_8(k+1)=x7(k+1)/3 ;x7_9(k+1)=x7(k+1)/3 ;
% x8_6(k+1)=x8(k+1)/3 ;x8_7(k+1)=x8(k+1)/3 ;x8_9(k+1)=x8(k+1)/3 ;
% x9_6(k+1)=x9(k+1)/3 ;x9_7(k+1)=x9(k+1)/3 ;x9_8(k+1)=x9(k+1)/3;
% 
% 
% 
% 
% % y
% y1_2(k+1)=y1(k+1)/4 ;y1_3(k+1)=y1(k+1)/4;y1_4(k+1)=y1(k+1)/4;y1_5(k+1)=y1(k+1)/4;
% y2_1(k+1)=y2(k+1)/4 ;y2_3(k+1)=y2(k+1)/4 ;y2_4(k+1)=y2(k+1)/4 ;y2_5(k+1)=y2(k+1)/4 ;
% y3_1(k+1)=y3(k+1)/4 ;y3_2(k+1)=y3(k+1)/4 ;y3_4(k+1)=y3(k+1)/4 ;y3_5(k+1)=y3(k+1)/4 ;
% y4_1(k+1)=y4(k+1)/4 ;y4_2(k+1)=y4(k+1)/4 ;y4_3(k+1)=y4(k+1)/4;y4_5(k+1)=y4(k+1)/4;
% y5_1(k+1)=y5(k+1)/4;y5_2(k+1)=y5(k+1)/4 ;y5_3(k+1)=y5(k+1)/4 ;y5_4(k+1)=y5(k+1)/4;
% y6_7(k+1)=y6(k+1)/3 ;y6_8(k+1)=y6(k+1)/3 ;y6_9(k+1)=y6(k+1)/3 ;
% y7_6(k+1)=y7(k+1)/3  ;y7_8(k+1)=y7(k+1)/3;y7_9(k+1)=y7(k+1)/3 ;
% y8_6(k+1)=y8(k+1)/3 ;y8_7(k+1)=y8(k+1)/3 ;y8_9(k+1)=y8(k+1)/3 ;
% y9_6(k+1)=y9(k+1)/3 ;y9_7(k+1)=y9(k+1)/3 ;y9_8(k+1)=y9(k+1)/3;

   
    for i=1:9
       L(i,k)=P(i,k)-Y(i,k);
    end
    
    sump(1,k)=sum(P(1:5,k));%电出力求和
    sumh(1,k)=sum(P(6:9,k));%热出力求和

end

% y6(40)=1.65; y7(40)=1.73;y8(40)=1.83;y9(40)=0;%
% p6(40)=174.80;p7(40)=116.12;p8(40)=137.55;p9(40)=128.74;

%% 设置数据存储矩阵

for k=50:500  %正常运行
      X(1,k)=x1(k);P(1,k)=p1(k);Y(1,k)=y1(k);
    X(2,k)=x2(k); P(2,k)=p2(k);Y(2,k)=y2(k);
    X(3,k)=x3(k);P(3,k)=p3(k);Y(3,k)=y3(k);
    X(4,k)=x4(k);P(4,k)=p4(k);Y(4,k)=y4(k);
    X(5,k)=x5(k);P(5,k)=p5(k);Y(5,k)=y5(k);
    X(6,k)=x6(k);P(6,k)=p6(k);Y(6,k)=y6(k);
    X(7,k)=x7(k);P(7,k)=p7(k);Y(7,k)=y7(k);  
    X(8,k)=x8(k);P(8,k)=p8(k);Y(8,k)=y8(k);
    X(9,k)=x9(k);P(9,k)=p9(k);Y(9,k)=y9(k);
   

%     X_1(1,k)=x1_2(k);Y_1(1,k)=y1_2(k);
%     X_1(2,k)=x1_3(k);Y_1(2,k)=y1_3(k);
%     X_1(3,k)=x1_4(k);Y_1(3,k)=y1_4(k);
%     X_1(4,k)=x1_5(k);Y_1(4,k)=y1_5(k); %子状态数据存储状态
%    
% 
%     X_2(1,k)=x2_1(k);Y_2(1,k)=y2_1(k);
%     X_2(2,k)=x2_3(k);Y_2(2,k)=y2_3(k);
%     X_2(3,k)=x2_4(k);Y_2(3,k)=y2_4(k);
%     X_2(4,k)=x2_5(k);Y_2(4,k)=y2_5(k);
%  
%    
%     
% 
% 
%     X_3(1,k)=x3_1(k);Y_3(1,k)=y3_1(k);
%     X_3(2,k)=x3_2(k);Y_3(2,k)=y3_2(k);
%     X_3(3,k)=x3_4(k);Y_3(3,k)=y3_4(k);
%     X_3(4,k)=x3_5(k);Y_3(4,k)=y3_5(k);
%   
%     
% 
% 
%     X_4(1,k)=x4_1(k);Y_4(1,k)=y4_1(k);
%     X_4(2,k)=x4_2(k);Y_4(2,k)=y4_2(k);
%     X_4(3,k)=x4_3(k);Y_4(3,k)=y4_3(k);
%     X_4(4,k)=x4_5(k);Y_4(4,k)=y4_5(k);
%    
%  
%     
% 
%     X_5(1,k)=x5_1(k);Y_5(1,k)=y5_1(k);
%     X_5(2,k)=x5_2(k);Y_5(2,k)=y5_2(k);
%     X_5(3,k)=x5_3(k);Y_5(3,k)=y5_3(k);
%     X_5(4,k)=x5_4(k);Y_5(4,k)=y5_4(k);
%   
%     
%     
%     X_6(1,k)=x6_7(k);Y_6(1,k)=y6_7(k);
%     X_6(2,k)=x6_8(k);Y_6(2,k)=y6_8(k);  
%     X_6(3,k)=x6_9(k);Y_6(3,k)=y6_9(k);
% 
% 
%    
%     X_7(1,k)=x7_6(k);Y_7(1,k)=y7_6(k);
%     X_7(2,k)=x7_8(k);Y_7(2,k)=y7_8(k);  
%     X_7(3,k)=x7_9(k);Y_7(3,k)=y7_9(k);
% 
% 
%     
%     X_8(1,k)=x8_6(k);Y_8(1,k)=y8_6(k);
%     X_8(2,k)=x8_7(k);Y_8(2,k)=y8_7(k);  
%     X_8(3,k)=x8_9(k);Y_8(3,k)=y8_9(k);
% 
% 
%    
%     X_9(1,k)=x9_6(k);Y_9(1,k)=y9_6(k);
%     X_9(2,k)=x9_7(k);Y_9(2,k)=y9_7(k);  
%     X_9(3,k)=x9_8(k);Y_9(3,k)=y9_8(k);
% 
%   
% 
% %% 状态关系1
% % x
% x1(k)= x2_1(k)+x3_1(k)+x4_1(k)+x5_1(k);
% x2(k)= x1_2(k)+x3_2(k)+x4_2(k)+x5_2(k);
% x3(k)= x1_3(k)+x2_3(k)+x4_3(k)+x5_3(k);
% x4(k)= x1_4(k)+x2_4(k)+x3_4(k)+x5_4(k);
% x5(k)= x1_5(k)+x2_5(k)+x3_5(k)+x4_5(k);
% x6(k)= x7_6(k)+x8_6(k)+x9_6(k);
% x7(k)= x6_7(k)+x8_7(k)+x9_7(k);
% x8(k)= x6_8(k)+x7_8(k)+x9_8(k);
% x9(k)= x6_9(k)+x7_9(k)+x8_9(k);
% 
% 
% % y
% y1(k)= y2_1(k)+y3_1(k)+y4_1(k)+y5_1(k);
% y2(k)= y1_2(k)+y3_2(k)+y4_2(k)+y5_2(k);
% y3(k)= y1_3(k)+y2_3(k)+y4_3(k)+y5_3(k);
% y4(k)= y1_4(k)+y2_4(k)+y3_4(k)+y5_4(k);
% y5(k)= y1_5(k)+y2_5(k)+y3_5(k)+y4_5(k);
% y6(k)= y7_6(k)+y8_6(k)+y9_6(k);
% y7(k)= y6_7(k)+y8_7(k)+y9_7(k);
% y8(k)= y6_8(k)+y7_8(k)+y9_8(k);
% y9(k)= y6_9(k)+y7_9(k)+y8_9(k);

   

 
  %%  分布式算法  
   x1(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y1(k);
    p1(k+1)=(x1(k+1)-13.45)/(2*0.0833);
    y1(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p1(k)-p1(k+1);%运用完全分布式经济调度算法进行迭代
   
    x2(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y2(k);
    p2(k+1)=(x2(k+1)-15)/(2*0.0825);
    y2(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p2(k)-p2(k+1);
    
    x3(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y3(k);
    p3(k+1)=(x3(k+1)-20.66)/(2*0.0935);
    y3(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p3(k)-p3(k+1);
    
    x4(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y4(k);
    p4(k+1)=(x4(k+1)-19.1)/(2*(0.0875-0.01));
    y4(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p4(k)-p4(k+1);
   
    x5(k+1)=1/5*(x1(k)+x2(k)+x3(k)+x4(k)+x5(k))+h*y5(k);
    p5(k+1)=(x5(k+1)-12.5-0.04*p6(k))/(2*0.06);%增大电、热、气间的耦合系数可以
    y5(k+1)=1/5*(y1(k)+y2(k)+y3(k)+y4(k)+y5(k))+p5(k)-p5(k+1);
    
    x6(k+1)=1/3*(x6(k)+x7(k)+x8(k))+h*y6(k);
    p6(k+1)=(x6(k+1)-4.2-0.04*p5(k+1))/(2*0.06);
    y6(k+1)=1/3*(y6(k)+y7(k)+y8(k))+p6(k)-p6(k+1);
    
    x7(k+1)=1/3*(x6(k)+x7(k)+x8(k))+h*y7(k);
    p7(k+1)=(x7(k+1)-15)/(2*0.07);
    y7(k+1)=1/3*(y6(k)+y7(k)+y8(k))+p7(k)-p7(k+1);
    
   
    x8(k+1)=1/3*(x6(k)+x7(k)+x8(k))+h*y8(k);
    p8(k+1)=(x8(k+1)-12)/(2*0.07);
    y8(k+1)=1/3*(y6(k)+y7(k)+y8(k))+p8(k)-p8(k+1);
    
    
%     x9(k+1)=1/4*(x6(k)+x7(k)+x8(k)+x9(k))+h*y9(k);
%     p9(k+1)=(x9(k+1)-11.2)/(2*0.078);                           
%     y9(k+1)=1/4*(y6(k)+y7(k)+y8(k)+y9(k))+p9(k)-p9(k+1);
     x9(k+1)=x9(k);
     p9(k+1)=128.59;                           
     y9(k+1)=0; %智能体9的信息不再进行更新
  % 状态关系2

 
 
% %lamda
% x1_2(k+1)=x1(k+1)/4 ;x1_3(k+1)=x1(k+1)/4;x1_4(k+1)=x1(k+1)/4;x1_5(k+1)=x1(k+1)/4;
% x2_1(k+1)=x2(k+1)/4 ;x2_3(k+1)=x2(k+1)/4 ;x2_4(k+1)=x2(k+1)/4 ;x2_5(k+1)=x2(k+1)/4 ;
% x3_1(k+1)=x3(k+1)/4 ;x3_2(k+1)=x3(k+1)/4 ;x3_4(k+1)=x3(k+1)/4 ;x3_5(k+1)=x3(k+1)/4 ;
% x4_1(k+1)=x4(k+1)/4;x4_2(k+1)=x4(k+1)/4 ;x4_3(k+1)=x4(k+1)/4;x4_5(k+1)=x4(k+1)/4;
% x5_1(k+1)=x5(k+1)/4;x5_2(k+1)=x5(k+1)/4 ;x5_3(k+1)=x5(k+1)/4 ;x5_4(k+1)=x5(k+1)/4;
% x6_7(k+1)=x6(k+1)/3 ;x6_8(k+1)=x6(k+1)/3 ;x6_9(k+1)=x6(k+1)/3 ;
% x7_6(k+1)=x7(k+1)/3  ;x7_8(k+1)=x7(k+1)/3 ;x7_9(k+1)=x7(k+1)/3 ;
% x8_6(k+1)=x8(k+1)/3 ;x8_7(k+1)=x8(k+1)/3 ;x8_9(k+1)=x8(k+1)/3 ;
% x9_6(k+1)=x9(k+1)/3 ;x9_7(k+1)=x9(k+1)/3 ;x9_8(k+1)=x9(k+1)/3;
% 
% 
% 
% 
% %y
% y1_2(k+1)=y1(k+1)/4 ;y1_3(k+1)=y1(k+1)/4;y1_4(k+1)=y1(k+1)/4;y1_5(k+1)=y1(k+1)/4;
% y2_1(k+1)=y2(k+1)/4 ;y2_3(k+1)=y2(k+1)/4 ;y2_4(k+1)=y2(k+1)/4 ;y2_5(k+1)=y2(k+1)/4 ;
% y3_1(k+1)=y3(k+1)/4 ;y3_2(k+1)=y3(k+1)/4 ;y3_4(k+1)=y3(k+1)/4 ;y3_5(k+1)=y3(k+1)/4 ;
% y4_1(k+1)=y4(k+1)/4 ;y4_2(k+1)=y4(k+1)/4 ;y4_3(k+1)=y4(k+1)/4;y4_5(k+1)=y4(k+1)/4;
% y5_1(k+1)=y5(k+1)/4;y5_2(k+1)=y5(k+1)/4 ;y5_3(k+1)=y5(k+1)/4 ;y5_4(k+1)=y5(k+1)/4;
% y6_7(k+1)=y6(k+1)/3 ;y6_8(k+1)=y6(k+1)/3 ;y6_9(k+1)=y6(k+1)/3 ;
% y7_6(k+1)=y7(k+1)/3  ;y7_8(k+1)=y7(k+1)/3;y7_9(k+1)=y7(k+1)/3 ;
% y8_6(k+1)=y8(k+1)/3 ;y8_7(k+1)=y8(k+1)/3 ;y8_9(k+1)=y8(k+1)/3 ;
% y9_6(k+1)=y9(k+1)/3 ;y9_7(k+1)=y9(k+1)/3 ;y9_8(k+1)=y9(k+1)/3;


     for i=1:9
       L(i,k)=P(i,k)-Y(i,k);
    end
    
    sump(1,k)=sum(P(1:5,k));%电出力求和
    sumh(1,k)=sum(P(6:9,k));%热出力求和
  
end

pp=p1(500)+p2(500)+p3(500)+p4(500)+p5(500);
ph=p6(500)+p7(500)+p8(500)+p9(500);



% 初始负荷计算
pp1=p1(1)+p2(1)+p3(1)+p4(1)+p5(1);
ph1=p6(1)+p7(1)+p8(1)+p9(1);



% 出力校验

R=ones(1,12);%设置机组出力校验矩阵

    if P(1,500)>=50 &&  P(1,500)<=250
        R(1,1)=1;
    else
        R(1,1)=0;
    end   %对POD1机组进行出力检验
    
    if P(2,500)>=45 &&  P(2,500)<=210
        R(1,2)=1;
    else
        R(1,2)=0;
    end  %对POD2机组进行出力检验
     if P(3,500)>=50 &&  P(3,500)<=200
        R(1,3)=1;
    else
        R(1,3)=0;
    end %对POD3机组进行出力检验
     if P(4,500)>=48 &&  P(4,500)<=220
        R(1,4)=1;
    else
        R(1,4)=0;
    end %对POD4机组进行出力检验
  xv= [0 265 200 0  0]; %chp的热出力坐标
  yv= [247 220 90 100 247];%chp的电出力坐标
  x=P(6,500);
  y=P(5,500);
R(1,5)=inpolygon(x,y,xv,yv);%CHP机组进行出力检验
R(1,6)=inpolygon(x,y,xv,yv);%CHP机组进行出力检验
if P(7,500)>=75 &&  P(7,500)<=300
        R(1,7)=1;
    else
        R(1,7)=0;
    end   %对HOD1机组进行出力检验
if P(8,500)>=80 &&  P(8,500)<=350
        R(1,8)=1;
    else
        R(1,8)=0;
    end   %对HOD2机组进行出力检验
if P(9,500)>=80 &&  P(9,500)<=320
        R(1,9)=1;
    else
        R(1,9)=0;
end


%主函数绘图值


a=P(1,500);%光伏
a1=P(2,500);%风机
a2=P(3,500);%火电1
a3=P(4,500);%电用户中心
a4=P(5,500);%chp-p
a5=P(6,500);%chp-h
a6=P(7,500);%燃煤锅炉1
a7=P(8,500);%热用户中心
a8=P(9,500);%燃煤锅炉2
b=X(1,500);%光伏
b1=X(2,500);%风机
b2=X(3,500);%火电1
b3=X(4,500);%电用户中心
b4=X(5,500);%chp-p
b5=X(6,500);%chp-h
b6=X(7,500);%燃煤锅炉1
b7=X(8,500);%热用户中心
b8=X(9,500);%燃煤锅炉2

a12=pp;%电负荷平衡
a13=ph;%热负荷平衡


% %画子图
% figure
% 
% for i=1:5%对增量成本画图
% plot(X(i,:),'-','LineWidth',1.5);
% colororder('default')
% ylim([0,50]); % 设置右y轴的界限
% xlabel('Iterations','Fontname', 'Times New Roman','FontSize',25);
% %ylabel('λ ','Fontname', 'Times New Roman','FontSize',25);
% hold on
% end
% for i=6:9%对增量成本画图
% plot(X(i,:),'-','LineWidth',1.5);
% colororder('default')
% ylim([0,50]); % 设置右y轴的界限
% xlabel('Iterations','Fontname', 'Times New Roman','FontSize',25);
% ylabel('λ','Fontname', 'Times New Roman','FontSize',25);
% hold on
% end
%     
% 
% 
% 
% legend('\lambda1','\lambda2','\lambda3','\lambdaLA_P','\lambdaCHP-P','\lambdaCHP-H','\lambda7', '\lambdaLA_H','\lambda9')
% legend('boxoff') 
%     
% % for i=1:12%对增量成本画图
% %        plot(X(i,:), 'LineWidth',1.5);
% % legend('\lambda1','\lambda2','\lambda3','\lambda4','\lambdaCHP-P','\lambdaCHP-H','\lambda7', '\lambda8','\lambda9','\lambdaP2G','\lambda11','\lambda12','NumColumns',3)
% % legend('boxoff')  
% %     xlabel('Iterations','Fontname', 'Times New Roman','FontSize',25);
% %     ylabel('λ ','Fontname', 'Times New Roman','FontSize',25);
% %     hold on
% % end
% 
% % %% 电增量成本
% % figure
% % for i=1:5%对增量成本画图
% %        plot(X(i,:), 'LineWidth',1.5);
% % legend('\lambda1','\lambda2','\lambda3','\lambda4','\lambdaCHP-P','NumColumns',3)
% % legend('boxoff')  
% %     xlabel('Iterations','Fontname', 'Times New Roman','FontSize',25);
% %     ylabel('λ ','Fontname', 'Times New Roman','FontSize',25);
% %     hold on
% % end
% % 
% % % %% 耦合增量成本
% % % figure
% % % for i=5:6%对增量成本画图
% % %    plot(X(i,:), 'LineWidth',1.5);
% % %     hold on
% % % end
% % % plot(X(10,:), 'LineWidth',1.5);
% % % legend('\lambdaCHP-P','\lambdaCHP-H','\lambdaP2G','NumColumns',3)
% % % %legend('\lambdaCHP-P','\lambdaCHP-H','NumColumns',3)
% % % legend('boxoff')  
% % %     xlabel('Iterations','Fontname', 'Times New Roman','FontSize',25);
% % %     ylabel('λ ','Fontname', 'Times New Roman','FontSize',25);
% % %% 热增量成本
% % figure
% % for i=6:9%对增量成本画图
% %        plot(X(i,:), 'LineWidth',1.5);
% % legend('\lambdaCHP-H','\lambda7', '\lambda8','\lambda9','NumColumns',3)
% % legend('boxoff')  
% %     xlabel('Iterations','Fontname', 'Times New Roman','FontSize',25);
% %     ylabel('λ ','Fontname', 'Times New Roman','FontSize',25);
% %     hold on
% % end
% 
% 
% 
% 
% 
% figure 
% for j=1:9%对局部功率偏差画图
%     plot(Y(j,:), 'LineWidth',1.5);
%      plot(0);
%     legend('y1', 'y2','y3','yLA_P','yCHP-P','yCHP-H','y7', 'yLA_H','y9','NumColumns',3)
%     legend('boxoff') 
%     ylim([0,100]); % 设置y轴的界限
%     xlabel('Iterations','Fontname', 'Times New Roman','FontSize',25);
%     ylabel('y ','Fontname', 'Times New Roman','FontSize',25);
% 
%     hold on
% end
% % 
% % for j=10:12%对局部功率偏差画图
% %     plot(Y(j,:), 'LineWidth',1.5);
% %     legend('y10', 'y11','y12')
% %     legend('boxoff') 
% %     xlabel('Iterations','Fontname', 'Times New Roman','FontSize',25);
% %     ylabel('y ','Fontname', 'Times New Roman','FontSize',25);
% %     hold on
% % end
% 
% 
% 
% % 
% % figure 
% % subplot(4,1,1)
% % for j=1:4%对机组出力画图
% %     plot(P(j,:),'-','LineWidth',1.5);
% %     colororder('default')
% %     ylim([50,200]); % 设置y轴的界限
% %     legend('POD1', 'POD2','POD3','POD4','NumColumns',4)
% %     legend('boxoff')
% %     xlabel('Iterations','Fontname', 'Times New Roman','FontSize',20);
% %     ylabel('P','Fontname', 'Times New Roman','FontSize',20);
% %     hold on
% % end
% % subplot(4,1,2)
% % for j=5:6%对机组出力画图
% %     plot(P(j,:),'-','LineWidth',1.5); 
% %     hold on
% % end
% % 
% % colororder('default')
% % ylim([30,200]); % 设置y轴的界限
% % legend('CHP-P','CHP-H','P2G','NumColumns',4)
% % legend('boxoff')
% % xlabel('Iterations','Fontname', 'Times New Roman','FontSize',20);
% % ylabel('X','Fontname', 'Times New Roman','FontSize',20)
% % subplot(4,1,3)
% % for j=7:9%对机组出力画图
% %     plot(P(j,:),'-','LineWidth',1.5); 
% %     colororder('default')
% %     ylim([50,150]); % 设置y轴的界限
% %     xlabel('Iterations','Fontname', 'Times New Roman','FontSize',20);
% %     ylabel('H','Fontname', 'Times New Roman','FontSize',20);
% %     hold on
% % end
% %  legend('HOD7', 'HOD8','HOD9','NumColumns',3)
% %  legend('boxoff') 
% 
% 
% % %% 电出力
% % figure 
% % for j=1:4%对机组出力画图
% %     plot(P(j,:),'-','LineWidth',1.5);
% % 
% %     colororder('default')
% %     ylim([0,200]); % 设置y轴的界限
% %     legend('POD1', 'POD2','POD3','POD4','NumColumns',4)
% %     legend('boxoff')
% %     xlabel('Iterations','Fontname', 'Times New Roman','FontSize',20);
% %     ylabel('P','Fontname', 'Times New Roman','FontSize',20);
% %     hold on
% % end
% % 
% % %% 耦合机组出力
% % figure 
% % for j=5:6%对机组出力画图
% %     plot(P(j,:),'-','LineWidth',1.5); 
% %     hold on
% % end
% % 
% % colororder('default')
% % %ylim([0,300]); % 设置y轴的界限
% % legend('CHP-P','CHP-H','P2G','NumColumns',4)
% % legend('boxoff')
% % xlabel('Iterations','Fontname', 'Times New Roman','FontSize',20);
% % ylabel('X','Fontname', 'Times New Roman','FontSize',20)
% % 
% % %% 热出力
% % figure
% % for j=7:9%对机组出力画图
% %     plot(P(j,:),'-','LineWidth',1.5); 
% %     colororder('default')
% % %    ylim([0,500]); % 设置y轴的界限
% %     xlabel('Iterations','Fontname', 'Times New Roman','FontSize',20);
% %     ylabel('H','Fontname', 'Times New Roman','FontSize',20);
% %     hold on
% % end
% %  legend('HOD7', 'HOD8','HOD9','NumColumns',3)
% %  legend('boxoff') 
% 
% 
% %% 全部出力
% figure 
% for j=1:9%对机组出力画图
%     plot(P(j,:),'lineWidth',1);
%      legend('POD1', 'POD2','POD3','LA_P','CHP-P','CHP-H','HOD7', 'LA_H','HOD9')
%      legend('boxoff') 
%     xlabel('Iterations','Fontname', 'Times New Roman','FontSize',25);
%     ylabel('x ','Fontname', 'Times New Roman','FontSize',25);
%     hold on
% end
% 
% 
% figure
% plot(sump, 'LineWidth',1.5);%对总电功率画图
% hold on 
% %plot([1,500],[pp1,pp1], 'LineWidth',1.5);%电需求画图
% hold on
% plot(sumh, 'LineWidth',1.5);%对总热功率画图
% hold on 
% %plot([1,500],[ph1,ph1], 'LineWidth',1.5);%热需求画图
% 
% legend('\SigmaP','\SigmaH','\SigmaG','NumColumns',6)
% legend('boxoff') 
% %ylim([0,800])
%  xlabel('Iterations','Fontname', 'Times New Roman','FontSize',15);
%  ylabel('\SigmaP|\SigmaH|\SigmaG and PD|HD|GD','Fontname', 'Times New Roman','FontSize',15);
%  hold on
% 
% %   figure
% %   plot(xv,yv,x(R(1,5)),y(R(1,6)),'.r',x(~R(1,5)),y(~R(1,6)),'.b') %CHP机组出力是否在其热-电可行域内
% % %     